Revit 2027 API
BuiltInFailures.ForeignFileFailures Class
 Failures about files saved by applications that were not developed or licensed by Autodesk.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ForeignFileFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static class ForeignFileFailures
Public NotInheritable Class ForeignFileFailures
public ref class ForeignFileFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ForeignFileFailures = class end
The BuiltInFailures.ForeignFileFailures type exposes the following members.
Properties
Name | Description
ForeignFile |  This file [FamilyName] was saved by an application that was not developed or licensed by Autodesk.
ForeignLink |  This file [RvtLinkName] was saved by an application that was not developed or licensed by Autodesk.
Top
See Also
Reference
Autodesk.Revit.DB Namespace